### import pandas

In [ ]:
import pandas as pd

> pandas.read_csv(filepath_or_buffer, *, sep=<no_default>, delimiter=None, header='infer', names=<no_default>, index_col=None, usecols=None, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=<no_default>, skip_blank_lines=True, parse_dates=None, infer_datetime_format=<no_default>, keep_date_col=<no_default>, date_parser=<no_default>, date_format=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal='.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, encoding_errors='strict', dialect=None, on_bad_lines='error', delim_whitespace=<no_default>, low_memory=True, memory_map=False, float_precision=None, storage_options=None, dtype_backend=<no_default>)

### 1. Reading csv file from machine

In [12]:
file1=pd.read_csv("D:/Gen AI/Course/Machine_Learning/Data_Files/Supervise_learning/advertising.csv")
file1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   TV         200 non-null    float64
 1   Radio      200 non-null    float64
 2   Newspaper  200 non-null    float64
 3   Sales      200 non-null    float64
dtypes: float64(4)
memory usage: 6.4 KB

### 2. Reading csv file from URL

#### Github : convert normal github url into  https://raw.githubusercontent.com/

In [20]:
import requests
from io import StringIO

url = "https://raw.githubusercontent.com/laxmimerit/All-CSV-ML-Data-Files-Download/master/Restaurant%20-%20Week%201%20Sales.csv"
df = pd.read_csv(url)

print(df.head())

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

### 2. Other Parameters :

### -> Seperators : comma seperated values, csv file dont have columns names

In [26]:
d2= pd.read_csv("../../Data_Files/Supervise_learning/students.csv", sep=',')
d2.head()

        Name  Age       City
0  Student_1   22     Mumbai
1  Student_2   25     Mumbai
2  Student_3   23    Chennai
3  Student_4   20  Hyderabad
4  Student_5   20    Chennai

In [25]:
# changing or defining columns name
d3= pd.read_csv("../../Data_Files/Supervise_learning/students.csv", names=['NAME','AGE','LOCATION'])
d3.head()

        NAME  AGE   LOCATION
0       Name  Age       City
1  Student_1   22     Mumbai
2  Student_2   25     Mumbai
3  Student_3   23    Chennai
4  Student_4   20  Hyderabad

In [24]:
# indexing a col 
d4= pd.read_csv("../../Data_Files/Supervise_learning/students.csv", index_col='Name')
d4.head()

           Age       City
Name
Student_1   22     Mumbai
Student_2   25     Mumbai
Student_3   23    Chennai
Student_4   20  Hyderabad
Student_5   20    Chennai

In [32]:
# some times data is not arrange properly in CSV files and when we read it, col become rows 
# and comes as 1st row in that case we need to define the header=1 so that pandas arrange the data while reading

d5=pd.read_csv('../../Data_Files/Supervise_learning/students_header.csv')
d5.head()

           -  -.1        -.2
0       Name  Age       City
1  Student_1   22     Mumbai
2  Student_2   25     Mumbai
3  Student_3   23    Chennai
4  Student_4   20  Hyderabad

In [36]:
d5=pd.read_csv('../../Data_Files/Supervise_learning/students_header.csv', index_col='Name', header=1)
d5.head()

           Age       City
Name
Student_1   22     Mumbai
Student_2   25     Mumbai
Student_3   23    Chennai
Student_4   20  Hyderabad
Student_5   20    Chennai

### Fetching only usefull columns from file usecols=[]

In [37]:
d6=pd.read_csv('../../Data_Files/Lesson_03_Supervised_Learning_ Regression_and_its_Application/diabetes_dataset.csv')
d6.head()

,PatientID,Age,Gender,BMI,BloodPressure,Insulin,Glucose,DiabetesPedigreeFunction,Outcome
0,1,52,0,30.239636,149,113,115,0.312886,1
1,2,53,1,30.932781,71,39,104,0.389526,0
2,3,21,0,45.092714,161,67,151,1.205869,0
3,4,39,0,47.795530,101,165,184,0.595201,1
4,5,22,1,20.718108,160,158,116,0.974248,1

In [38]:
d6=pd.read_csv('../../Data_Files/Lesson_03_Supervised_Learning_ Regression_and_its_Application/diabetes_dataset.csv', usecols=['PatientID','Age','Insulin','DiabetesPedigreeFunction'])
d6.head()

   PatientID  Age  Insulin  DiabetesPedigreeFunction
0          1   52      113                  0.312886
1          2   53       39                  0.389526
2          3   21       67                  1.205869
3          4   39      165                  0.595201
4          5   22      158                  0.974248

### Skipping rows and fetching only nrows

In [40]:
## skipping 1 col
d6=pd.read_csv('../../Data_Files/Lesson_03_Supervised_Learning_ Regression_and_its_Application/diabetes_dataset.csv')
d6

,PatientID,Age,Gender,BMI,BloodPressure,Insulin,Glucose,DiabetesPedigreeFunction,Outcome
0,1,52,0,30.239636,149,113,115,0.312886,1
1,2,53,1,30.932781,71,39,104,0.389526,0
2,3,21,0,45.092714,161,67,151,1.205869,0
3,4,39,0,47.795530,101,165,184,0.595201,1
4,5,22,1,20.718108,160,158,116,0.974248,1
...,...,...,...,...,...,...,...,...,...
95,96,28,1,47.903244,164,55,90,0.470471,1
96,97,56,1,34.282756,121,242,74,1.254736,1
97,98,58,0,35.490390,152,206,161,1.378215,0
98,99,60,1,40.044859,85,159,130,0.224376,0
99,100,40,0,37.899312,138,215,91,0.907850,0

In [50]:
d6=pd.read_csv('../../Data_Files/Lesson_03_Supervised_Learning_ Regression_and_its_Application/diabetes_dataset.csv',skiprows=[1,5])
d6

,PatientID,Age,Gender,BMI,BloodPressure,Insulin,Glucose,DiabetesPedigreeFunction,Outcome
0,2,53,1,30.932781,71,39,104,0.389526,0
1,3,21,0,45.092714,161,67,151,1.205869,0
2,4,39,0,47.795530,101,165,184,0.595201,1
3,6,73,1,25.080940,153,71,79,1.308201,1
4,7,64,1,39.641021,93,53,125,1.756948,0
...,...,...,...,...,...,...,...,...,...
93,96,28,1,47.903244,164,55,90,0.470471,1
94,97,56,1,34.282756,121,242,74,1.254736,1
95,98,58,0,35.490390,152,206,161,1.378215,0
96,99,60,1,40.044859,85,159,130,0.224376,0
97,100,40,0,37.899312,138,215,91,0.907850,0

In [ ]:
## fetching only nrows
d6=pd.read_csv('../../Data_Files/Lesson_03_Supervised_Learning_ Regression_and_its_Application/diabetes_dataset.csv', nrows=15)
d6

,PatientID,Age,Gender,BMI,BloodPressure,Insulin,Glucose,DiabetesPedigreeFunction,Outcome
0,1,52,0,30.239636,149,113,115,0.312886,1
1,2,53,1,30.932781,71,39,104,0.389526,0
2,3,21,0,45.092714,161,67,151,1.205869,0
3,4,39,0,47.795530,101,165,184,0.595201,1
4,5,22,1,20.718108,160,158,116,0.974248,1
5,6,73,1,25.080940,153,71,79,1.308201,1
6,7,64,1,39.641021,93,53,125,1.756948,0
7,8,46,1,29.797374,81,123,99,0.194349,1
8,9,52,0,26.506155,119,195,178,2.018585,1
9,10,26,0,27.801654,104,56,74,1.606961,1
10,11,52,0,28.660349,102,200,188,0.296222,0
11,12,75,0,45.233099,102,237,102,2.196589,0
12,13,24,0,22.803572,130,136,187,2.310094,0
13,14,75,0,40.830696,120,147,134,0.246587,0
14,15,31,1,35.913829,112,177,80,0.764506,0

### using lambda function while reading csv file - converter

In [60]:
d7= pd.read_csv('../../Data_Files/Lesson_03_Supervised_Learning_ Regression_and_its_Application/diabetes_dataset.csv', 
                converters={ 'Gender': lambda x : 'M' if x=='1' else 'F' ,'BMI': lambda x : float(x) })
d7.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 9 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   PatientID                 100 non-null    int64
 1   Age                       100 non-null    int64
 2   Gender                    100 non-null    object
 3   BMI                       100 non-null    float64
 4   BloodPressure             100 non-null    int64
 5   Insulin                   100 non-null    int64
 6   Glucose                   100 non-null    int64
 7   DiabetesPedigreeFunction  100 non-null    float64
 8   Outcome                   100 non-null    int64
dtypes: float64(2), int64(6), object(1)
memory usage: 7.2+ KB

### handling datas in CSV file - as while reading data it act as string but we want it in Date format

In [67]:
d8= pd.read_csv('../../Data_Files/Supervise_learning/bollywood_movies_with_separate_date_columns.csv').info()
d8

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   title              50 non-null     object
 1   date_of_release    50 non-null     object
 2   genre              50 non-null     object
 3   director           50 non-null     object
 4   budget_crores      50 non-null     int64
 5   box_office_crores  50 non-null     int64
 6   day                50 non-null     int64
 7   month              50 non-null     int64
 8   time               50 non-null     object
dtypes: int64(4), object(5)
memory usage: 3.6+ KB

In [66]:
d8= pd.read_csv('../../Data_Files/Supervise_learning/bollywood_movies_with_separate_date_columns.csv', parse_dates=['date_of_release']).info()
d8

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   title              50 non-null     object
 1   date_of_release    50 non-null     datetime64[ns]
 2   genre              50 non-null     object
 3   director           50 non-null     object
 4   budget_crores      50 non-null     int64
 5   box_office_crores  50 non-null     int64
 6   day                50 non-null     int64
 7   month              50 non-null     int64
 8   time               50 non-null     object
dtypes: datetime64[ns](1), int64(4), object(4)
memory usage: 3.6+ KB

### combining different date, month, year col into single col

In [79]:
d8= pd.read_csv('../../Data_Files/Supervise_learning/bollywood_movies_with_separate_date_columns.csv',parse_dates=['date_of_release'],)
d8.head()

,title,date_of_release,genre,director,budget_crores,box_office_crores,day,month,time
0,Sholay,2013-01-23,Comedy,Rajkumar Hirani,41,424,23,1,23:37:56
1,Dangal,1994-06-25,Drama,Zoya Akhtar,50,588,25,6,01:26:15
2,3 Idiots,2016-10-02,Comedy,Sanjay Leela Bhansali,64,63,2,10,22:19:53
3,Bajrangi Bhaijaan,2016-07-22,Thriller,Rajkumar Hirani,136,699,22,7,04:35:29
4,Lagaan,1996-03-23,Comedy,Zoya Akhtar,197,416,23,3,17:29:47

In [91]:
d8['datetime_of_release']= pd.to_datetime(d8[['day','month']].assign(year=d8['date_of_release'].dt.year),format="%d-%m-%Y")
d8['datetime_of_release']=pd.to_datetime(d8['datetime_of_release'], format="%d-%m-%Y")

""" 
Why .dt.year?
.dt is used to extract datetime components:

Expression	Meaning
df["col"].dt.year	Extract year
df["col"].dt.month	Extract month
df["col"].dt.day	Extract day
df["col"].dt.hour	Extract hour (if time exists)
dayfirst=True = telling that 
"""
d8.head()

,title,date_of_release,genre,director,budget_crores,box_office_crores,day,month,time,datetime_of_release
0,Sholay,2013-01-23,Comedy,Rajkumar Hirani,41,424,23,1,23:37:56,2013-01-23
1,Dangal,1994-06-25,Drama,Zoya Akhtar,50,588,25,6,01:26:15,1994-06-25
2,3 Idiots,2016-10-02,Comedy,Sanjay Leela Bhansali,64,63,2,10,22:19:53,2016-10-02
3,Bajrangi Bhaijaan,2016-07-22,Thriller,Rajkumar Hirani,136,699,22,7,04:35:29,2016-07-22
4,Lagaan,1996-03-23,Comedy,Zoya Akhtar,197,416,23,3,17:29:47,1996-03-23

In [ ]:
d8['datetime_of_release']=d8['datetime_of_release'].astype(str)+ ' '+d8['time'] 
d8.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 10 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   title                50 non-null     object
 1   date_of_release      50 non-null     datetime64[ns]
 2   genre                50 non-null     object
 3   director             50 non-null     object
 4   budget_crores        50 non-null     int64
 5   box_office_crores    50 non-null     int64
 6   day                  50 non-null     int64
 7   month                50 non-null     int64
 8   time                 50 non-null     object
 9   datetime_of_release  50 non-null     object
dtypes: datetime64[ns](1), int64(4), object(5)
memory usage: 4.0+ KB

### Converters - use to apply any functions at run time while reading CSV file

In [92]:
ipl1=pd.read_csv('../../Data_Files/IP_Data_Sets/matches.csv')
ipl1.head()

,id,Season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,IPL-2017,Hyderabad,05-04-2017,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN
1,2,IPL-2017,Pune,06-04-2017,Mumbai Indians,Rising Pune Supergiant,Rising Pune Supergiant,field,normal,0,Rising Pune Supergiant,0,7,SPD Smith,Maharashtra Cricket Association Stadium,A Nand Kishore,S Ravi,NaN
2,3,IPL-2017,Rajkot,07-04-2017,Gujarat Lions,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN
3,4,IPL-2017,Indore,08-04-2017,Rising Pune Supergiant,Kings XI Punjab,Kings XI Punjab,field,normal,0,Kings XI Punjab,0,6,GJ Maxwell,Holkar Cricket Stadium,AK Chaudhary,C Shamshuddin,NaN
4,5,IPL-2017,Bangalore,08-04-2017,Royal Challengers Bangalore,Delhi Daredevils,Royal Challengers Bangalore,bat,normal,0,Royal Challengers Bangalore,15,0,KM Jadhav,M Chinnaswamy Stadium,NaN,NaN,NaN

In [93]:
ipl1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 756 entries, 0 to 755
Data columns (total 18 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               756 non-null    int64
 1   Season           756 non-null    object
 2   city             749 non-null    object
 3   date             756 non-null    object
 4   team1            756 non-null    object
 5   team2            756 non-null    object
 6   toss_winner      756 non-null    object
 7   toss_decision    756 non-null    object
 8   result           756 non-null    object
 9   dl_applied       756 non-null    int64
 10  winner           752 non-null    object
 11  win_by_runs      756 non-null    int64
 12  win_by_wickets   756 non-null    int64
 13  player_of_match  752 non-null    object
 14  venue            756 non-null    object
 15  umpire1          754 non-null    object
 16  umpire2          754 non-null    object
 17  umpire3          119 non-null    object
dtypes: int64(4), object(14)
memory usage: 106.4+ KB

### converting All teams full names to short form for easy reading

In [98]:
# writing function to convert full form to short forms
def team_short_forms(team):
    if team == "Royal Challengers Bangalore":
        return 'RCB'
    elif team == "Kolkata Knight Riders":
        return 'KKR'
    elif team == "Mumbai Indians":
        return 'MI'
    elif team == "Gujarat Lions":
        return 'GL'
    elif team == "Rising Pune Supergiant":
        return 'RPS'
    elif team == "Delhi Daredevils":
        return 'DD'
    elif team == "Kings XI Punjab":
        return 'KP'
    else :
        return team

In [99]:
ipl1=pd.read_csv('../../Data_Files/IP_Data_Sets/matches.csv', converters={'team1': team_short_forms })
ipl1.head()

,id,Season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,IPL-2017,Hyderabad,05-04-2017,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN
1,2,IPL-2017,Pune,06-04-2017,MI,Rising Pune Supergiant,Rising Pune Supergiant,field,normal,0,Rising Pune Supergiant,0,7,SPD Smith,Maharashtra Cricket Association Stadium,A Nand Kishore,S Ravi,NaN
2,3,IPL-2017,Rajkot,07-04-2017,GL,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN
3,4,IPL-2017,Indore,08-04-2017,RPS,Kings XI Punjab,Kings XI Punjab,field,normal,0,Kings XI Punjab,0,6,GJ Maxwell,Holkar Cricket Stadium,AK Chaudhary,C Shamshuddin,NaN
4,5,IPL-2017,Bangalore,08-04-2017,RCB,Delhi Daredevils,Royal Challengers Bangalore,bat,normal,0,Royal Challengers Bangalore,15,0,KM Jadhav,M Chinnaswamy Stadium,NaN,NaN,NaN

### while reading data, some data is missing, in that missing values, some time it return NaN, --(hiphen), so to standardise that we must set single common value for nan value

In [102]:
d9=pd.read_csv('../../Data_Files/Supervise_learning/employee_data_missing.csv')
d9

       Name  Age Department Salary       City
0      Amit   23    Finance  70000     Mumbai
1     Rohit   23      Sales    NaN     Mumbai
2     Sneha   30    Finance  60000  Bangalore
3     Priya   38    Finance    NaN  Bangalore
4      Ravi   35  Marketing  55000    Chennai
5     Karan   35      Sales           Kolkata
6     Nisha   27         IT  80000     Mumbai
7    Farhan   40         HR  55000      Delhi
8    Simran   28         IT  55000      Delhi
9     Arjun   40    Finance  50000      Delhi
10    Meera   23         IT  55000    Kolkata
11  Saurabh   35    Finance  80000    Kolkata
12    Pooja   23         IT  70000     Mumbai
13   Nikhil   23      Sales  55000  Bangalore
14   Ayesha   38  Marketing  55000    Kolkata
15    Varun   28         HR  80000     Mumbai
16    Kabir   29      Sales  55000     Mumbai
17     Tina   25         IT      -  Bangalore
18    Rahul   25      Sales             Delhi
19    Deepa   38      Sales  60000     Mumbai

In [103]:
d9=pd.read_csv('../../Data_Files/Supervise_learning/employee_data_missing.csv', na_values=['-',' '])
d9

       Name  Age Department   Salary       City
0      Amit   23    Finance  70000.0     Mumbai
1     Rohit   23      Sales      NaN     Mumbai
2     Sneha   30    Finance  60000.0  Bangalore
3     Priya   38    Finance      NaN  Bangalore
4      Ravi   35  Marketing  55000.0    Chennai
5     Karan   35      Sales      NaN    Kolkata
6     Nisha   27         IT  80000.0     Mumbai
7    Farhan   40         HR  55000.0      Delhi
8    Simran   28         IT  55000.0      Delhi
9     Arjun   40    Finance  50000.0      Delhi
10    Meera   23         IT  55000.0    Kolkata
11  Saurabh   35    Finance  80000.0    Kolkata
12    Pooja   23         IT  70000.0     Mumbai
13   Nikhil   23      Sales  55000.0  Bangalore
14   Ayesha   38  Marketing  55000.0    Kolkata
15    Varun   28         HR  80000.0     Mumbai
16    Kabir   29      Sales  55000.0     Mumbai
17     Tina   25         IT      NaN  Bangalore
18    Rahul   25      Sales      NaN      Delhi
19    Deepa   38      Sales  60000.0     Mumbai

### Loading a large data into a chunk

In [105]:
d=pd.read_csv('../../Data_Files/Lesson_03_Supervised_Learning_ Regression_and_its_Application/housing.csv')
d.shape

(20640, 9)

In [109]:
d=pd.read_csv('../../Data_Files/Lesson_03_Supervised_Learning_ Regression_and_its_Application/housing.csv', chunksize=5500)

In [110]:
for chunk in d:
    print(chunk.shape)

(5500, 9)
(5500, 9)
(5500, 9)
(4140, 9)

### Filtering data/col while loading data

In [115]:
housing_data= pd.read_csv('../../Data_Files/Lesson_03_Supervised_Learning_ Regression_and_its_Application/housing_with_ocean_proximity.csv')
housing_data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [116]:
housing_data.shape

(20640, 10)

In [119]:
housing_data['median_house_value'].isna().sum()

np.int64(0)

In [120]:
housing_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4140 entries, 16500 to 20639
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           4140 non-null   float64
 1   latitude            4140 non-null   float64
 2   housing_median_age  4140 non-null   float64
 3   total_rooms         4140 non-null   float64
 4   total_bedrooms      4092 non-null   float64
 5   population          4140 non-null   float64
 6   households          4140 non-null   float64
 7   median_income       4140 non-null   float64
 8   median_house_value  4140 non-null   float64
 9   ocean_proximity     4140 non-null   object
dtypes: float64(9), object(1)
memory usage: 323.6+ KB

### loading only dat with population more than 400 and less that 450

In [129]:
housing_filter_data =[]

for chunks in pd.read_csv('../../Data_Files/Lesson_03_Supervised_Learning_ Regression_and_its_Application/housing_with_ocean_proximity.csv', chunksize=5500):
    filtered= chunks[(chunks['population'] > 400) & (chunks['population'] < 450)]
    housing_filter_data.append(filtered)

final_df= pd.concat(housing_filter_data)
print(final_df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 294 entries, 5 to 20601
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           294 non-null    float64
 1   latitude            294 non-null    float64
 2   housing_median_age  294 non-null    float64
 3   total_rooms         294 non-null    float64
 4   total_bedrooms      292 non-null    float64
 5   population          294 non-null    float64
 6   households          294 non-null    float64
 7   median_income       294 non-null    float64
 8   median_house_value  294 non-null    float64
 9   ocean_proximity     294 non-null    object
dtypes: float64(9), object(1)
memory usage: 25.3+ KB
None

### Calculating mean without loading data fully

In [118]:
house_value=0
house_count=0
for housing_data in pd.read_csv('../../Data_Files/Lesson_03_Supervised_Learning_ Regression_and_its_Application/housing_with_ocean_proximity.csv', chunksize=5500):
    house_value += housing_data['median_house_value'].sum()
    house_count += housing_data['median_house_value'].count()

avg_house_value=house_value/house_count
avg_house_value

np.float64(206855.81690891474)